In [160]:
import pandas as pd

In [161]:
data = "desktop/Pymoli.csv"
data_df = pd.read_csv(data)

In [162]:
data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [163]:
total = data_df['SN'].nunique()
print(f'Total Players: {total}')

Total Players: 576

In [164]:
items = data_df['Item ID'].nunique()

In [165]:
data_df['Price'].mean()

3.050987179487176

In [166]:
num_purchases = data_df['Purchase ID'].count()

In [167]:
data_df['Price'].sum()

2379.77

In [168]:
summary = [{"Number of Unique Items": items, "Average Price": "$3.05","Number of Purchases": num_purchases, "Total Revenue": "$2379.77"}]

purchase = pd.DataFrame(summary)
purchase

  Average Price  Number of Purchases  Number of Unique Items Total Revenue
0         $3.05                  780                     183      $2379.77

In [169]:
organized_df = data_df [["SN", "Gender"]]
organized_df.head()

              SN Gender
0        Lisim78   Male
1    Lisovynya38   Male
2     Ithergue48   Male
3  Chamassasya86   Male
4      Iskosia90   Male

In [170]:
drop = organized_df.drop_duplicates()

In [171]:
drop['SN'].nunique()

576

In [172]:
gender_count = drop['Gender'].value_counts()
gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [173]:
gender_percentage = gender_count/576*100

In [174]:
gender_demo = pd.DataFrame({"Total Count": gender_count, "Percentage of Players": gender_percentage.round(2)})
gender_demo

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [175]:
drop_unique['Gender'].value_counts()

Male                     144
Female                    79
Other / Non-Disclosed     12
Name: Gender, dtype: int64

In [176]:
organized_df = data_df [["Gender", "Price"]]
organized_df.groupby('Gender').aggregate("Gender")

In [177]:
purchase_count = data_df['Gender'].value_counts()
purchase_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [178]:
gender_avg = organized_df.groupby('Gender')['Price'].mean()
gender_avg.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [179]:
gender_total = organized_df.groupby('Gender')['Price'].sum()
gender_total

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [180]:
total_avg = organized_df.groupby('Gender')['Price'].sum()/drop['Gender'].value_counts()
total_avg.round(2)

Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [181]:
gender_data = pd.DataFrame({"Purchase Count": purchase_count,"Average Purchase Price": gender_avg.round(2),"Total Purchase Value": gender_total, "Average Total Purchase Per Person": total_avg.round(2)})
gender_data

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

In [182]:
data_df['Age'].max()

45

In [183]:
data_df['Age'].min()

7

In [184]:
bins = [0, 10, 15, 20, 25, 30, 35, 40, 45]
group_names = ['<10', '10 to 14', '15 to 19', '20 to 24', '25 to 29', '30 to 34', '35 to 39', '40']

In [188]:
pd.cut(data_df["Age"], bins, labels = group_names).head()

0    15 to 19
1    35 to 39
2    20 to 24
3    20 to 24
4    20 to 24
Name: Age, dtype: category
Categories (8, object): [<10 < 10 to 14 < 15 to 19 < 20 to 24 < 25 to 29 < 30 to 34 < 35 to 39 < 40]

In [189]:
org = organized_df = data_df [["SN","Age", "Price"]]
org.head()

              SN  Age  Price
0        Lisim78   20   3.53
1    Lisovynya38   40   1.56
2     Ithergue48   24   4.88
3  Chamassasya86   24   3.27
4      Iskosia90   23   1.44

In [190]:
data_df["Age Range"] = pd.cut(data_df["Age"], bins, labels=group_names)
data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15 to 19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35 to 39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20 to 24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20 to 24
4,4,Iskosia90,23,Male,131,Fury,1.44,20 to 24

In [191]:
age_count = data_df['Age Range'].value_counts()

In [210]:
data_group = data_df.groupby("Age Range")
percent = data_group["Age"].count()/576*100
percent
avg_age = data_group["Price"].mean()
avg_age.round(2)

Age Range
<10         3.40
10 to 14    2.90
15 to 19    3.11
20 to 24    3.02
25 to 29    2.88
30 to 34    2.99
35 to 39    3.40
40          3.08
Name: Price, dtype: float64

In [211]:
age_data = pd.DataFrame({"Total Count": age_count, "Percent of Players": percent.round(2)})
age_data

          Total Count  Percent of Players
10 to 14           54                9.38
15 to 19          200               34.72
20 to 24          325               56.42
25 to 29           77               13.37
30 to 34           52                9.03
35 to 39           33                5.73
40                  7                1.22
<10                32                5.56

In [212]:
age_spend = data_group["Price"].sum()
age_spend

Age Range
<10         108.96
10 to 14    156.60
15 to 19    621.56
20 to 24    981.64
25 to 29    221.42
30 to 34    155.71
35 to 39    112.35
40           21.53
Name: Price, dtype: float64

In [217]:
age_purchase_data = pd.DataFrame({"Purcase Count": age_count, "Total Purchase Value": age_spend, "Average Purchase Price": avg_age.round(2)})
age_purchase_data

          Purcase Count  Total Purchase Value  Average Purchase Price
10 to 14             54                156.60                    2.90
15 to 19            200                621.56                    3.11
20 to 24            325                981.64                    3.02
25 to 29             77                221.42                    2.88
30 to 34             52                155.71                    2.99
35 to 39             33                112.35                    3.40
40                    7                 21.53                    3.08
<10                  32                108.96                    3.40

In [33]:
top_spender = data_df [["SN", "Price"]]
top_spender.head()

              SN  Price
0        Lisim78   3.53
1    Lisovynya38   1.56
2     Ithergue48   4.88
3  Chamassasya86   3.27
4      Iskosia90   1.44

In [235]:
sn_count = data_df['SN'].value_counts()
decend_count = sn_count.sort_values(ascending=False)
decend_count.head()

Lisosia93      5
Iral74         4
Idastidru52    4
Strithenu87    3
Silaera56      3
Name: SN, dtype: int64

In [219]:
top_total = top_spender.groupby('SN')['Price'].sum()

In [220]:
decend = top_total.sort_values(ascending=False)

In [243]:
avg_top_price = decend/decend_count

In [259]:
top_spender = pd.DataFrame({"Total Purchase Value": decend, "Purchase Count": decend_count, "Average Purchase Price": avg_top_price.round(2)})
top_spender.sort_values(by='Total Purchase Value', ascending=False).head()

             Total Purchase Value  Purchase Count  Average Purchase Price
Lisosia93                   18.96               5                    3.79
Idastidru52                 15.45               4                    3.86
Chamjask73                  13.83               3                    4.61
Iral74                      13.62               4                    3.40
Iskadarya95                 13.10               3                    4.37

In [251]:
data_df['Item Name'].value_counts()

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Extraction, Quickblade Of Trembling Hands        9
Fiery Glass Crusader                             9
Persuasion                                       9
Nirvana                                          9
Lightning, Etcher of the King                    8
Winter's Bite                                    8
Singed Scalpel                                   8
Pursuit, Cudgel of Necromancy                    8
Retribution Axe                                  8
Wolf                                             8
Shadow Strike, Glory of Ending Hope              8
Brutality Ivory Warmace                          8
Malificent Bag                                   7
Suspension                                       7
Oathbreaker, Spellblade of Trials                7
Demise                                           7
Heartstriker, Legacy of the Light                7
Exiled Doomblade                                 7
Vengeance Cleaver                                7
Glimmer, Ender of the Moon                       7
Thorn, Satchel of Dark Souls                     7
Blood Infused Guardian                           6
Frenzied Scimitar                                6
Second Chance                                    6
Hero Cane                                        6
Verdict                                          6
Blood-Forged Skeletal Spine                      6
Ghastly Adamantite Protector                     6
                                                ..
Rage, Legacy of the Lone Victor                  2
Heartseeker, Reaver of Souls                     2
Sun Strike, Jaws of Twisted Visions              2
Darkheart, Butcher of the Champion               2
Frenzy, Defender of the Harvest                  2
Foul Edge                                        2
Dreamkiss                                        2
Torchlight, Bond of Storms                       2
Unholy Wand                                      2
Trickster                                        2
Foul Titanium Battle Axe                         2
Whistling Mithril Warblade                       2
Winterthorn, Defender of Shifting Worlds         2
Relentless Iron Skewer                           2
Curved Axe                                       2
Stormfury Longsword                              2
Rusty Skull                                      2
Spectral Diamond Doomblade                       2
Flux, Destroyer of Due Diligence                 2
Stormfury Mace                                   2
Alpha, Reach of Ending Hope                      1
Riddle, Tribute of Ended Dreams                  1
The Decapitator                                  1
Ghost Reaver, Longsword of Magic                 1
Undead Crusader                                  1
Betrayer                                         1
Exiled Mithril Longsword                         1
Endbringer                                       1
Celeste                                          1
Gladiator's Glaive                               1
Name: Item Name, Length: 179, dtype: int64

In [39]:
popular_items = data_df [["Item ID", "Item Name", 'Price']]
popular_items.groupby('Item Name').aggregate("Item Name")

In [351]:
popular_item_price = popular_items['Price'].value_counts()

In [352]:
most_popular = popular_items.groupby('Item Name')['Price'].sum()

In [353]:
most_popularprice = popular_items['Item Name'].value_counts()

In [354]:
item_price = popular_items.groupby('Item Name')['Price'].value_counts

In [355]:
popular_data = pd.DataFrame({"Purchase Count": most_popularprice,"Total Purchase Value": most_popular, "Price": popular_item_price})
popular_data.sort_values(by='Purchase Count', ascending=False).head()

,Purchase Count,Total Purchase Value,Price
Final Critic,13.0,59.99,NaN
"Oathbreaker, Last Hope of the Breaking Storm",12.0,50.76,NaN
Persuasion,9.0,28.99,NaN
Nirvana,9.0,44.10,NaN
"Extraction, Quickblade Of Trembling Hands",9.0,31.77,NaN